sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_wwdt.h
/* WWDT_MIS Bits */
/* WWDT_MIS[INTTIM] Bits */
#define WWDT_MIS_INTTIM_OFS                      (0)                             /* !< INTTIM Offset */
#define WWDT_MIS_INTTIM_MASK                     ((uint32_t)0x00000001U)         /* !< Interval Timer Interrupt. */
#define WWDT_MIS_INTTIM_CLR                      ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define WWDT_MIS_INTTIM_SET                      ((uint32_t)0x00000001U)         /* !< Interrupt occurred */

/* WWDT_ISET Bits */
/* WWDT_ISET[INTTIM] Bits */
#define WWDT_ISET_INTTIM_OFS                     (0)                             /* !< INTTIM Offset */
#define WWDT_ISET_INTTIM_MASK                    ((uint32_t)0x00000001U)         /* !< Interval Timer Interrupt. */
#define WWDT_ISET_INTTIM_NO_EFFECT               ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define WWDT_ISET_INTTIM_SET                     ((uint32_t)0x00000001U)         /* !< Set Interrupt */

/* WWDT_ICLR Bits */
/* WWDT_ICLR[INTTIM] Bits */
#define WWDT_ICLR_INTTIM_OFS                     (0)                             /* !< INTTIM Offset */
#define WWDT_ICLR_INTTIM_MASK                    ((uint32_t)0x00000001U)         /* !< Interval Timer Interrupt. */
#define WWDT_ICLR_INTTIM_NO_EFFECT               ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define WWDT_ICLR_INTTIM_CLR                     ((uint32_t)0x00000001U)         /* !< Clear Interrupt */

/* WWDT_PWREN Bits */
/* WWDT_PWREN[ENABLE] Bits */
#define WWDT_PWREN_ENABLE_OFS                    (0)                             /* !< ENABLE Offset */
#define WWDT_PWREN_ENABLE_MASK                   ((uint32_t)0x00000001U)         /* !< Enable the power Note: For safety
                                                                                    devices the power cannot be disabled
                                                                                    once enabled. */
#define WWDT_PWREN_ENABLE_DISABLE                ((uint32_t)0x00000000U)         /* !< Disable Power */
#define WWDT_PWREN_ENABLE_ENABLE                 ((uint32_t)0x00000001U)         /* !< Enable Power */
/* WWDT_PWREN[KEY] Bits */
#define WWDT_PWREN_KEY_OFS                       (24)                            /* !< KEY Offset */
#define WWDT_PWREN_KEY_MASK                      ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define WWDT_PWREN_KEY_UNLOCK_W                  ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* WWDT_RSTCTL Bits */
/* WWDT_RSTCTL[RESETSTKYCLR] Bits */
#define WWDT_RSTCTL_RESETSTKYCLR_OFS             (1)                             /* !< RESETSTKYCLR Offset */
#define WWDT_RSTCTL_RESETSTKYCLR_MASK            ((uint32_t)0x00000002U)         /* !< Clear [GPRCM.STAT.RESETSTKY] */
#define WWDT_RSTCTL_RESETSTKYCLR_NOP             ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define WWDT_RSTCTL_RESETSTKYCLR_CLR             ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* WWDT_RSTCTL[RESETASSERT] Bits */
#define WWDT_RSTCTL_RESETASSERT_OFS              (0)                             /* !< RESETASSERT Offset */
#define WWDT_RSTCTL_RESETASSERT_MASK             ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral
                                                                                    Note: For safety devices a watchdog
                                                                                    reset by software is not possible. */
#define WWDT_RSTCTL_RESETASSERT_NOP              ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define WWDT_RSTCTL_RESETASSERT_ASSERT           ((uint32_t)0x00000001U)         /* !< Assert reset */
/* WWDT_RSTCTL[KEY] Bits */
#define WWDT_RSTCTL_KEY_OFS                      (24)                            /* !< KEY Offset */
#define WWDT_RSTCTL_KEY_MASK                     ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define WWDT_RSTCTL_KEY_UNLOCK_W                 ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* WWDT_STAT Bits */
/* WWDT_STAT[RESETSTKY] Bits */
#define WWDT_STAT_RESETSTKY_OFS                  (16)                            /* !< RESETSTKY Offset */
#define WWDT_STAT_RESETSTKY_MASK                 ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define WWDT_STAT_RESETSTKY_NORES                ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define WWDT_STAT_RESETSTKY_RESET                ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

/* WWDT_PDBGCTL Bits */
/* WWDT_PDBGCTL[FREE] Bits */
#define WWDT_PDBGCTL_FREE_OFS                    (0)                             /* !< FREE Offset */
#define WWDT_PDBGCTL_FREE_MASK                   ((uint32_t)0x00000001U)         /* !< Free run control */
#define WWDT_PDBGCTL_FREE_STOP                   ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define WWDT_PDBGCTL_FREE_RUN                    ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */

/* WWDT_EVT_MODE Bits */
/* WWDT_EVT_MODE[INT0_CFG] Bits */
#define WWDT_EVT_MODE_INT0_CFG_OFS               (0)                             /* !< INT0_CFG Offset */
#define WWDT_EVT_MODE_INT0_CFG_MASK              ((uint32_t)0x00000003U)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.CPU_INT][0] */
#define WWDT_EVT_MODE_INT0_CFG_DISABLE           ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define WWDT_EVT_MODE_INT0_CFG_SOFTWARE          ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define WWDT_EVT_MODE_INT0_CFG_HARDWARE          ((uint32_t)0x00000002U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */

/* WWDT_DESC Bits */
/* WWDT_DESC[MINREV] Bits */
#define WWDT_DESC_MINREV_OFS                     (0)                             /* !< MINREV Offset */
#define WWDT_DESC_MINREV_MASK                    ((uint32_t)0x0000000FU)         /* !< Minor rev of the IP */
#define WWDT_DESC_MINREV_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define WWDT_DESC_MINREV_MAXIMUM                 ((uint32_t)0x0000000FU)         /* !< Highest possible value */
/* WWDT_DESC[MAJREV] Bits */
#define WWDT_DESC_MAJREV_OFS                     (4)                             /* !< MAJREV Offset */
#define WWDT_DESC_MAJREV_MASK                    ((uint32_t)0x000000F0U)         /* !< Major rev of the IP */
#define WWDT_DESC_MAJREV_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define WWDT_DESC_MAJREV_MAXIMUM                 ((uint32_t)0x000000F0U)         /* !< Highest possible value */
/* WWDT_DESC[INSTNUM] Bits */
#define WWDT_DESC_INSTNUM_OFS                    (8)                             /* !< INSTNUM Offset */
#define WWDT_DESC_INSTNUM_MASK                   ((uint32_t)0x00000F00U)         /* !< Instance Number within the device.
                                                                                    This will be a parameter to the RTL
                                                                                    for modules that can have multiple
                                                                                    instances */
#define WWDT_DESC_INSTNUM_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define WWDT_DESC_INSTNUM_MAXIMUM                ((uint32_t)0x00000F00U)         /* !< Highest possible value */
/* WWDT_DESC[FEATUREVER] Bits */
#define WWDT_DESC_FEATUREVER_OFS                 (12)                            /* !< FEATUREVER Offset */
#define WWDT_DESC_FEATUREVER_MASK                ((uint32_t)0x0000F000U)         /* !< Feature Set for the module
                                                                                    *instance* */
#define WWDT_DESC_FEATUREVER_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define WWDT_DESC_FEATUREVER_MAXIMUM             ((uint32_t)0x0000F000U)         /* !< Highest possible value */
/* WWDT_DESC[MODULEID] Bits */
#define WWDT_DESC_MODULEID_OFS                   (16)                            /* !< MODULEID Offset */
#define WWDT_DESC_MODULEID_MASK                  ((uint32_t)0xFFFF0000U)         /* !< Module identification contains a
                                                                                    unique peripheral identification
                                                                                    number. The assignments are
                                                                                    maintained in a central database for
                                                                                    all of the platform modules to ensure
                                                                                    uniqueness. */
#define WWDT_DESC_MODULEID_MINIMUM               ((uint32_t)0x00000000U)         /* !< Smallest value */
#define WWDT_DESC_MODULEID_MAXIMUM               ((uint32_t)0xFFFF0000U)         /* !< Highest possible value */

